{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "8297eede-26c8-4407-98f6-91254fad4220",
   "metadata": {},
   "source": [
    "#### Задание 1\n",
    "Написать код на Python в среде Jupyter Notebook для решения следующей задачи.\n",
    "\n",
    "Дана переменная, в которой хранится словарь, содержащий геометки для каждого пользователя (пример структуры данных приведён ниже). Вам нужно написать программу, которая выведет на экран множество уникальных геометок всех пользователей."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 55,
   "id": "f0073aff-8787-4491-a726-7dcc369b759b",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Пример работы программы:\n",
    "\n",
    "ids = {'user1': [213, 213, 213, 15, 213], \n",
    "       'user2': [54, 54, 119, 119, 119], \n",
    "       'user3': [213, 98, 98, 35]}\n",
    "# Результат: {98, 35, 15, 213, 54, 119}"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 65,
   "id": "254ba9e6-b4f8-42d1-9dc9-db26ba6518ec",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{98, 35, 15, 213, 54, 119}\n"
     ]
    }
   ],
   "source": [
    "unique_tags = set()\n",
    "for user_tags in ids.values():\n",
    "    unique_tags.update(user_tags)\n",
    "\n",
    "print(unique_tags)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "4a67fd72-1721-456b-8ba5-1e9f8a30484d",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "dc03e114-82bb-4eba-8506-f1833cdcd9d1",
   "metadata": {},
   "source": [
    "#### Задание 2\n",
    "Написать код на Python в среде Jupyter Notebook для решения следующей задачи.\n",
    "\n",
    "Дана переменная, в которой хранится список поисковых запросов пользователя (пример структуры данных приведён ниже). Вам нужно написать программу, которая выведет на экран распределение количества слов в запросах в требуемом виде."
   ]
  },
  {
   "cell_type": "raw",
   "id": "59e4a036-a319-4718-86dc-63d73ec276ea",
   "metadata": {},
   "source": [
    "Пример работы программы:\n",
    "\n",
    "queries = [\n",
    "    'смотреть сериалы онлайн',\n",
    "    'новости спорта',\n",
    "    'афиша кино',\n",
    "    'курс доллара',\n",
    "    'сериалы этим летом',\n",
    "    'курс по питону',\n",
    "    'сериалы про спорт',\n",
    "]\n",
    "Результат:\n",
    "\n",
    "Поисковых запросов, содержащих 2 слов(а): 42.86%\n",
    "Поисковых запросов, содержащих 3 слов(а): 57.14%"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 95,
   "id": "edd78b9b-c52b-4365-9b65-9fb536c4dd7b",
   "metadata": {},
   "outputs": [],
   "source": [
    "queries = [\n",
    "    'смотреть сериалы онлайн',\n",
    "    'новости спорта',\n",
    "    'афиша кино',\n",
    "    'курс доллара',\n",
    "    'сериалы этим летом',\n",
    "    'курс по питону',\n",
    "    'сериалы про спорт'\n",
    "]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 96,
   "id": "d9c819df-fb3d-43e3-8b6d-595ab23b910a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Поисковых запросов, содержащих 2 слов(а): 42.86%\n",
      "Поисковых запросов, содержащих 3 слов(а): 57.14%\n"
     ]
    }
   ],
   "source": [
    "# Считаем количество слов в каждом запросе\n",
    "word_counts = [len(query.split()) for query in queries]\n",
    "\n",
    "# Подсчитываем частоту каждого количества слов вручную\n",
    "total_queries = len(queries)\n",
    "count_dist = {}\n",
    "\n",
    "for count in word_counts:\n",
    "    if count in count_dist:\n",
    "        count_dist[count] += 1\n",
    "    else:\n",
    "        count_dist[count] = 1\n",
    "\n",
    "# Выводим результаты в требуемом формате\n",
    "for word_count in sorted(count_dist.keys()):\n",
    "    occurrences = count_dist[word_count]\n",
    "    percentage = (occurrences / total_queries) * 100\n",
    "    print(f\"Поисковых запросов, содержащих {word_count} слов(а): {percentage:.2f}%\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 97,
   "id": "ac45f9dc-bee5-474a-9bae-b5f5abe99ee0",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[3, 2, 2, 2, 3, 3, 3]"
      ]
     },
     "execution_count": 97,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "word_counts"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 98,
   "id": "4aca6735-7ed7-4f46-b242-aaafe23d95cc",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "7"
      ]
     },
     "execution_count": 98,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "total_queries"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 99,
   "id": "c62edf77-9cab-4cd1-9b61-b968becb9fd9",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{3: 4, 2: 3}"
      ]
     },
     "execution_count": 99,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "count_dist"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.13.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
