{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "6b31241b-e00c-487c-81c4-8c558c334cef",
   "metadata": {},
   "source": [
    "### Задание\n",
    "Вам нужно помочь секретарю автоматизировать работу. Для этого нужно написать программу, которая будет на основе хранимых данных исполнять пользовательские команды."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ed72a07e-a066-42ae-9b5c-10a1980f87c6",
   "metadata": {},
   "source": [
    "Общие требования к программе:\n",
    "\n",
    "● код должен быть грамотно декомпозирован: каждая функция отвечает за свою конкретную задачу, дублирующиеся функции переиспользуются, а их код не повторяется;\n",
    "\n",
    "● в коде отсутствуют глобальные переменные, за исключением documents и directories;\n",
    "\n",
    "● пользовательский ввод обрабатывается в цикле while до тех пор, пока пользователь явно не завершит программу вводом команды \"q\"."
   ]
  },
  {
   "cell_type": "raw",
   "id": "5bf0cac9-457e-45bc-8d92-3d681452e7b3",
   "metadata": {},
   "source": [
    "Исходные данные имеют следующую структуру:\n",
    "\n",
    "*1. перечень всех документов*\n",
    "\n",
    "documents = [\n",
    " {'type': 'passport', 'number': '2207 876234', 'name': 'Василий Гупкин'},\n",
    " {'type': 'invoice', 'number': '11-2', 'name': 'Геннадий Покемонов'},\n",
    " {'type': 'insurance', 'number': '10006', 'name': 'Аристарх Павлов'}\n",
    "]\n",
    "\n",
    "*2. перечень полок, на которых хранятся документы (если документ есть в documents, он обязательно должен быть и в directories)*\n",
    "\n",
    "directories = {\n",
    " '1': ['2207 876234', '11-2'],\n",
    " '2': ['10006'],\n",
    " '3': []\n",
    "}"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "13f8a74a-01ae-425d-8b50-4661e8b5a746",
   "metadata": {},
   "source": [
    "### Задание 1\n",
    "Пользователь по команде «p» может узнать владельца документа по его номеру."
   ]
  },
  {
   "cell_type": "raw",
   "id": "b587762c-c984-4e35-8df2-6737e592ce24",
   "metadata": {},
   "source": [
    "Пример работы программы:\n",
    "\n",
    "Введите команду:\n",
    "p\n",
    "\n",
    "Введите номер документа:\n",
    "10006\n",
    "\n",
    "Результат:\n",
    "Владелец документа: Аристарх Павлов"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "fba292cf-cc5b-409a-aefd-fc6711722899",
   "metadata": {},
   "outputs": [
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Введите команду:\n",
      " p\n",
      "Введите номер документа:\n",
      " 10006\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Владелец документа: Аристарх Павлов\n"
     ]
    }
   ],
   "source": [
    "documents = [\n",
    "    {\"type\": \"passport\", \"number\": \"2207 876234\", \"name\": \"Василий Гупкин\"},\n",
    "    {\"type\": \"invoice\", \"number\": \"11-2\", \"name\": \"Геннадий Покемонов\"},\n",
    "    {\"type\": \"insurance\", \"number\": \"10006\", \"name\": \"Аристарх Павлов\"}\n",
    "]\n",
    "\n",
    "directories = {\n",
    "    '1': ['2207 876234', '11-2'],\n",
    "    '2': ['10006'],\n",
    "    '3': []\n",
    "}\n",
    "\n",
    "def find_owner(doc_number):\n",
    "    for document in documents:\n",
    "        if document['number'] == doc_number:\n",
    "            return document['name']\n",
    "    return None\n",
    "\n",
    "def main():\n",
    "    while True:\n",
    "        command = input(\"Введите команду:\\n\").strip()\n",
    "        \n",
    "        if command == 'p':\n",
    "            doc_number = input(\"Введите номер документа:\\n\").strip()\n",
    "            owner = find_owner(doc_number)\n",
    "            \n",
    "            if owner:\n",
    "                print(\"Владелец документа: \" + owner)\n",
    "            else:\n",
    "                print(\"Документ не найден\")\n",
    "        \n",
    "        elif command == 'q':\n",
    "            break\n",
    "\n",
    "if __name__ == \"__main__\":\n",
    "    main()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "5ed00783-425a-477d-b394-ed083a0621f7",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.13.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
